> @simamGit +1 it looks like `TestAccComputeReservation_` is passing in CI as well. However, `TestAccComputeInstance_reservationAffinities` seems to be failing with a permadiff:
> 
> ```
> Terraform will perform the following actions:
> # google_compute_reservation.reservation must be replaced
> -/+ resource "google_compute_reservation" "reservation" {
> + commitment                    = (known after apply)
> ~ creation_timestamp            = "2021-12-23T11:32:06.647-08:00" -> (known after apply)
> ~ id                            = "projects/project-id/zones/us-central1-a/reservations/tf-test-resaffinity-et2yep0tb1" -> (known after apply)
> name                          = "tf-test-resaffinity-et2yep0tb1"
> ~ project                       = "project-id" -> (known after apply)
> ~ self_link                     = "https://www.googleapis.com/compute/v1/projects/project-id/zones/us-central1-a/reservations/tf-test-resaffinity-et2yep0tb1" -> (known after apply)
> specific_reservation_required = true
> ~ status                        = "READY" -> (known after apply)
> ~ zone                          = "https://www.googleapis.com/compute/v1/projects/project-id/zones/us-central1-a" -> "us-central1-a"
> - share_settings {
> - share_type = "LOCAL" -> null
> }
> ~ specific_reservation {
> count        = 1
> ~ in_use_count = 0 -> (known after apply)
> ~ instance_properties {
> machine_type     = "n1-standard-1"
> + min_cpu_platform = (known after apply)
> }
> }
> }
> ```
> 
> The relevant part is:
> 
> ```
> - share_settings {
> - share_type = "LOCAL" -> null
> }
> ```
> 
> This means that the API returned a value for this field that Terraform didn't expect, so Terraform is trying to set it to `null`. I believe you can work around this by adding `default_from_api` to shareSettings and shareType in terraform.yaml - that will make Terraform accept whatever the API returns.

Thanks Stephen for update. I think I now how to fix it. 